module.exports = {
    up: async (queryInterface, Sequelize) => {
        await queryInterface.bulkInsert(
            'questions',
            [
                {
                    text: "Я ніколи не використовував іграшки під час занять любов'ю.",
                    category_id: 2,
                },
                { text: 'Я ніколи не спав з незнайомкою.', category_id: 2 },
                {
                    text: 'Я ніколи не займався сексом в душі/джакузі.',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було сексу на одну ніч.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не відправляв нікому сексуальні фото.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не дивився пікантні фотографії.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не купував нижню білизну комусь.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи особисто не бачив іншу людиною голою.',
                    category_id: 2,
                },
                { text: 'Я ніколи не був в секс-шопі.', category_id: 2 },
                {
                    text: 'Я ніколи не підглядав ні за ким в душі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався сексом в людному місці.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не бачив еротичні сни з людиною, яка мені подобається.',

                    category_id: 2,
                },
                {
                    text: 'Я ніколи не шепотів нікому грязні словечка на вухо.',
                    category_id: 2,
                },
                { text: 'Я ніколи не спав з колишньою.', category_id: 2 },
                {
                    text: 'Я ніколи не травмовувався під час сексу.',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було ранкового сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не фантазував про когось іншого під час сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не знімав домашнє відео пікантного характеру.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не танцював приватний танець.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не фотографувався в нижній білизні.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не цілував чиєсь голе тіло.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не слав нікому фото статевих органів.',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було сексу по дружбі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався цим будучи нетверезим.',
                    category_id: 2,
                },
                { text: 'Я ніколи не займався сексом в морі.', category_id: 2 },
                {
                    text: 'Я ніколи не займався сексом у спальному мішку.',
                    category_id: 2,
                },
                { text: 'Я ніколи не брехав заради сексу.', category_id: 2 },
                { text: 'Я ніколи не носив чужу білизну.', category_id: 2 },
                { text: 'Я ніколи не дивився порно.', category_id: 2 },
                {
                    text: "Мене ніколи не прив'язували наручниками.",
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не брив інтимні місця своєї партнерки.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не їв іжу з голого тіла іншої людини.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався сексом більше 4 раз на день.',
                    category_id: 2,
                },
                {
                    text: "Мене ніколи не викривали під час занять любов'ю.",
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не бачив як цим займається мій друг.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не просив когось прислати мені голі фотографії.',
                    category_id: 2,
                },
                { text: 'У мене ніколи не було трійника.', category_id: 2 },
                {
                    text: 'У мене ніколи не було сексу в той же день, коли я познайомився з людиною.',
                    category_id: 2,
                },
                { text: 'Я ніколи не спав з кимось з роботи.', category_id: 2 },
                { text: 'Я ніколи не грав в рольові ігри.', category_id: 2 },
                { text: 'Я ніколи не мастурбував.', category_id: 2 },
                { text: 'Я ніколи не спав з проституткою.', category_id: 2 },
                {
                    text: 'Я ніколи не використовував лубрикант.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не фантазував про когось, хто зараз знаходиться в цій кімнаті.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався незахищеним сексом.',
                    category_id: 2,
                },
                { text: 'Я ніколи не імітував оргазм.', category_id: 2 },
                {
                    text: 'Я ніколи не займався сексом по телефону.',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було більше 10 партнерів.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався цим у час критичних днів партнерки.',
                    category_id: 2,
                },
                { text: 'Я ніколи не займався сексом стоячи.', category_id: 2 },
                { text: 'Я ніколи не був в стриптиз клубі.', category_id: 2 },
                {
                    text: 'Я ніколи не хотів чогось в ліжку, чого партнер досі не зробив.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів спати після сексу.',
                    category_id: 2,
                },
                { text: 'Я ніколи не нюхав одяг партнера.', category_id: 2 },
                {
                    text: 'Я ніколи не спав з тим, хто мене не приваблював.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не розглядав фотографії партнера, коли мастурбував.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не давав нікому сексуального прізвиська.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не засинав одразу після сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не думав, що я краще свого партнера у сексі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не думав, що мій партнер поганий у сексі.',
                    category_id: 2,
                },
                { text: 'Я ніколи не хотів сексу втрьох.', category_id: 2 },
                { text: 'Я ніколи не дивився гей-порно.', category_id: 2 },
                {
                    text: 'Я ніколи не "ліз на стіну" від відсутності сексу.',
                    category_id: 2,
                },
                { text: 'Я ніколи не читав книгу про секс.', category_id: 2 },
                {
                    text: 'Я ніколи не дивився навчальні відеоролики про секс.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не використовував вібратор.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не використовував пози з "Камасутри".',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався сексом на святкових подіях чи інших публічних заходах.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався сексом не в себе вдома.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався сексом на вулиці, в парку, в лісі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не брехав про свій досвід у сексі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався сексом з цнотливою дівчиною.',
                    category_id: 2,
                },
                { text: 'Мені ніколи не снився секс.', category_id: 2 },
                {
                    text: 'Я ніколи не робив цього на кухонному столі.',
                    category_id: 2,
                },
                { text: 'Я ніколи не засинав під час сексу.', category_id: 2 },
                {
                    text: 'Я ніколи не спав з однояйцевими близнюками.',
                    category_id: 2,
                },
                { text: 'Я ніколи не спав з партнером друга.', category_id: 2 },
                {
                    text: 'Я ніколи не мастурбував якимись предметами.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів чимскоріш закінчити статевий акт.',
                    category_id: 2,
                },
                { text: 'Я ніколи не домінував у сексі.', category_id: 2 },
                {
                    text: 'Я ніколи не хотів сексу з кимось іншої раси.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів бути пасивом у сексі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів бути активом у сексі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів спробувати анальний секс.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав фантазій про те, щоб мене звязали.',
                    category_id: 2,
                },
                {
                    text: 'Мене ніколи не приваблював грубий секс.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не стогнав надто голосно під час сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів спробувати побувати у свінгер-клубі.',
                    category_id: 2,
                },
                { text: 'Я ніколи не дзвонив повії.', category_id: 2 },
                {
                    text: 'Я ніколи не хотів когось з далеких родичів.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не розмовляв надто глибоко з батьками на цю тему.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не зупиняв партнера під час сексу тому, що щось не влаштовувало.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав суперечок з партнером щодо контрацептивів.',
                    category_id: 2,
                },
                { text: 'Я ніколи не мав золотого доща.', category_id: 2 },
                {
                    text: 'Я ніколи не задумувався над участю в оргіях.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів, щоб в мене кожну ніч був інший партнер.',
                    category_id: 2,
                },
                { text: 'Я ніколи не мав сексу в душі.', category_id: 2 },
                {
                    text: 'Я ніколи не мав сексу без поцілунків.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав 5-ти хвилинного сексу.',
                    category_id: 2,
                },
                { text: 'Я ніколи не займався цим >2 годин.', category_id: 2 },
                {
                    text: 'Я ніколи не купував іграшки для сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи серйозно не думав про зраду.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав сексуальних актів, через які мені соромно.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не брехав про к-сть полових партнерів.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не розповідав про потаємні фантазії теперішньому партнеру.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не відмовляв партнерові у сексі брехнею - болить голова, і подібне',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було сексу з людиною іншої раси.',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було сексу з людиною меншою, ніж я >= 10 років.',
                    category_id: 2,
                },
                {
                    text: 'У мене ніколи не було сексу з людиною старше мене на >=10 років.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не фантазував про вчительку/викладачку в постілі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не розумів бажання вільних відносин заради сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не пробачав зради партнера.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не хотів сексу на 1 побаченні.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав сексу в готелі на 1 ніч.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав сексу на ліжку батьків.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався цим на підлозі.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не займався оральним сексом на даху.',
                    category_id: 2,
                },
                { text: "Я ніколи не ковтав сім'я партнера.", category_id: 2 },
                {
                    text: 'Я ніколи не розглядав батькові журнали "Плейбой".',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не думав з ким би переспав, ставши жінкою.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав сексу з нетверезим партнером.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не мав сексу не бажаючи цього.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не уявляв рандомних людей голими.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не дивився фільм заради постільних сцен.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не фантазував про відому акторку в ліжку.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не писав список дівчат, що вміють добре займатись сексом.',
                    category_id: 2,
                },
                { text: 'Я ніколи не мав сексу на спір.', category_id: 2 },
                {
                    text: 'Я ніколи не зваблював когось комусь на зло.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не задівав органи партнера не обрізаними нігтями.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не роздирав тіло партнера до крові.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не ховав засоси від старших.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не чув звуку статевого акту батьків.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не спав в одній кімнаті поряд з іншими, які займалися сексом.',
                    category_id: 2,
                },
                { text: 'Я ніколи не їв під час сексу.', category_id: 2 },
                {
                    text: 'Я ніколи не використовував лід під час прелюдій.',
                    category_id: 2,
                },
                { text: 'Я ніколи не робив еротичний масаж.', category_id: 2 },
                {
                    text: 'Я ніколи не використовував свічки для сексу.',
                    category_id: 2,
                },
                {
                    text: 'Я ніколи не керував режимом секс-іграшки партнера.',
                    category_id: 2,
                },
                { text: 'Я ніколи штучно не віддаляв кінець.', category_id: 2 },
            ],
            {},
        );
    },

    down: async (queryInterface, Sequelize) => {
        await queryInterface.bulkDelete(
            'questions',
            { id: { [Sequelize.Op.gt]: 200 } },
            {},
        );
    },
};
