const BotReplies = {
    START: `Вітаю 😜 
            Я допоможу тобі з питання для гри "Я ніколи не...". Аби почати хутчій тисни на кнопки на клавіатурі!`,
    HELP: `Отож, все просто ✋ 
           Кожній з категорій питань відповідає кнопка на клавіатурі. При натисканні я даю випадкове питання з обраної тобою категорії. Якщо ти колись робив вказане, то загинаєш один палець/відкладаєш одну карточку/тощо. Програв той, у кого закінчились пальці/картки/інше. Нумо грати!`,
    STOP: 'Шкода, що гра закінчилась 😭 Повертайся!',
    NO_QUESTIONS: 'На жаль, питань у цій категорії ще немає 😩',
    CATEGORY_FINISHED:
        'На жаль, унікальні питання з цієї категорії кінчились 😰 Можливі повтори питань, на які ти вже відповідав.',
};

export default BotReplies;
