const BotReplies = {
    START: `Вітаю 😜 
Я допоможу тобі з твердженнями для гри "Я ніколи не...". Аби почати хутчій тисни на кнопки на клавіатурі!`,
    HELP: `Отож, все просто ✋ 
1. Кожній з категорій твердженнями відповідає кнопка на клавіатурі. 
2. При натисканні я даю випадкове твердження з обраної тобою категорії. 
3. Якщо ти колись робив вказане, то загинаєш один палець/відкладаєш одну карточку/тощо. 
5. Програв той, у кого закінчились пальці/картки/інше. 
Нумо грати!`,
    STOP: 'Шкода, що гра закінчилась 😭 Повертайся!',
    RESET: 'Статистика твоїх обіграних тверджень очищена 🙃',
    NOTHING_TO_RESET: 'У тебе ще немає статистики, аби її скинути 🤪',
    NO_QUESTIONS: 'На жаль, тверджень у цій категорії ще немає 😩',
    CATEGORY_FINISHED:
        'На жаль, унікальні твердження з цієї категорії кінчились 😰 Можливі повтори твердженнь, які ти вже обігрував.',
};

export default BotReplies;
